BANKS = {
    "087": "ASCB - แอสเซนด์ แบงก์",
    "034": "BAAC - ธกส.",
    "025": "BAY - กรุงศรีฯ",
    "002": "BBL - กรุงเทพ",
    "089": "BNKX - แบงก์เอกซ์",
    "045": "BNPP - บีเอ็นพีพี",
    "052": "BOCB - บีโอซี",
    "022": "CIMBT - ซีไอเอ็มบีไทย",
    "017": "CITI - ซิตี้แบงก์",
    "088": "CLCX - คลิกซ์",
    "032": "DGZ - ดอยซ์แบงก์",
    "033": "GHB - อาคารสงเคราะห์",
    "030": "GSB - ออมสิน",
    "031": "HSBC - ฮ่องกงและเซี่ยงไฮ้",
    "070": "ICBCT - ไอซีบีซี",
    "029": "IOBA - ไอโอบีเอ",
    "066": "ISBT - อิสลาม",
    "008": "JPMC - เจพีมอร์แกน",
    "004": "KBANK - กสิกรไทย",
    "069": "KK - เกียรตินาคิน",
    "006": "KTB - กรุงไทย",
    "073": "LHBANK - แลนด์ แอนด์ เฮ้าส์",
    "039": "MHCB - มิซูโฮ",
    "014": "SCB - ไทยพาณิชย์",
    "020": "SCBT - สแตนดาร์ดชาร์เตอร์ด",
    "018": "SMBC - ซูมิโตโม มิตซุย",
    "098": "SMEA - ธวพ.",
    "080": "SMTB - ซูมิโตโม มิตซุย ทรัสต์",
    "071": "TCRB - ไทยเครดิต",
    "067": "TISCO - ทิสโก้",
    "011": "TTB - ทหารไทยธนชาต",
    "024": "UOB - ยูโอบี"
}

def select_bank():
    print("\n=== เลือกธนาคาร ===")
    
    for code, name in BANKS.items():
        print(f"[{code}] {name}")

    while True:
        bank_code = input("\nกรอกรหัสธนาคาร: ").strip()

        if bank_code in BANKS:
            print(f"เลือกแล้ว: {BANKS[bank_code]}")
            return bank_code
        else:
            print("รหัสไม่ถูกต้อง ลองใหม่")